# задайте значение переменной b, чтобы результат был 2.5
a = 2
b = 0.5
print(a + b)

# сделайте так, чтобы программа приветствовала вас,
# используя переменную name и форматирование строк например "Привет, Миша!"
name = 'Миша'
print(f"Привет, {name}!")

# поправьте код, чтобы выводилось число
# на 10 больше, чем введённое
# например, пользователь ввел 10
# программа вывела 20
v = input('Введите число от 1 до 10: ')
print(int(v) + 10)

# поправьте код, чтобы выводилась строка
# Привет, ИМЯ! Как дела?
name = input('Введите ваше имя: ')
print(f"Привет, {name}! Как дела?")

# Выведите на экран при помощи print() результат работы:
# float('1')  # 1.0
# int('2.5')  # ValueError: invalid literal for int() with base 10: '2.5'
# int(2.5)    # 2
# bool(1)     # True
# bool('')    # False
# bool(0)     # False
